#coding:utf-8


__authors__ = ['"Liu Fei" <fei.liu@cs2c.com.cn>']
__version__ = "V0.1"

'''
# ChangeLog:
#---------------------------------------------------------------------------------
# Version        Date                Desc                            Author
#---------------------------------------------------------------------------------
# V0.1           2014/10/24          初始版本                                                            Liu Fei 
#---------------------------------------------------------------------------------
'''

from TestData.DataCenter import ITC01_SetUp as ModuleData

'''
---------------------------------------------------------------------------------------------------
@note: Pre-Test-Data
---------------------------------------------------------------------------------------------------
'''
########################################################################
# 1个数据中心信息（使用模块测试环境中的dc_nfs）                                                                                                                                    
########################################################################
dc_nfs_name = ModuleData.dc_nfs_name

#######################################################################################
# 1个存储域信息（只需要提供存储域名称，因为它是在模块测试环境中已经创建的data2_nfs）                                                                                                                               
#######################################################################################
data_nfs_name = ModuleData.data2_nfs_name

'''
---------------------------------------------------------------------------------------------------
@note: Test-Data
-----
'''



'''
---------------------------------------------------------------------------------------------------
@note: Post-Test-Data
---------------------------------------------------------------------------------------------------
'''




'''
---------------------------------------------------------------------------------------------------
@note: ExpectedResult
---------------------------------------------------------------------------------------------------
'''
expected_status_code_attach_sd = 201                    # 将存储域附加到数据中心，成功，返回状态码
expected_status_code_attach_sd_fail = 409               # 将存储域附加到数据中心，失败，返回状态码
expected_info_attach_sd_fail = '''
<fault>
    <reason>Operation Failed</reason>
    <detail>[Failed to attach Storage due to an error on the Data Center master Storage Domain.
-Please activate the master Storage Domain first.]</detail>
</fault>
'''
expected_status_code_deactivate_sd = 200                # 将存储域设置为维护状态，成功，返回状态码
expected_status_code_detach_sd = 200                    # 将存储域从数据中心分离，成功，返回状态码